controllers/PessoaController.php

    public function actionCreate()
    {
        $model = new Pessoa();

        if ($model->load(Yii::$app->request->post()) && $model->save()) {
---
INSERT INTO `pessoa` (`nome`) VALUES ('teu cu')

    protected function findModel($id)
    {
        if (($model = Pessoa::findOne($id)) !== null) {
---
SELECT * FROM `pessoa` WHERE `ID`='2'